---------------------------------------------------------
-- Скрипты добавления данных
---------------------------------------------------------

-- Группы статусов
INSERT INTO dicts.status_groups (status_group) 
VALUES 
('Пользователи'), 
('Заказы'), 
('Доставка'), 
('Поставки'),
('Товары'),
('Склад');

-- Статусы
INSERT INTO dicts.statuses (status_group_id, status_name) 
VALUES 
(1, 'Новый'), 
(1, 'Подтверждённый'), 
(1, 'Заблокирован'), 
(2, 'Новый'), 
(2, 'В обработке'),
(2, 'Оплачен'),
(2, 'Отменён пользователем'),
(2, 'Завершён'),
(3, 'Новая'),
(3, 'В пути'),
(3, 'Завершена'),
(4, 'Новая'),
(6, 'В наличии'),
(6, 'Заканчивается'),
(6, 'Отсутствует');

-- Пользователи
INSERT INTO dicts.users (last_name, first_name, middle_name, birth_date, email, password_hash, phone, gender, status_id)
VALUES
( 'Акимов', 'Юрий', 'Владимирович', '1980-10-05', 'yura.akimov.21@bk.ru', md5('123'), '8(917)121-92-92', 1, 5 ),
( 'Сайфуллин', 'Артур', 'Зиннурович', '1981-01-19', '190181@list.ru', md5('456'), '8(917)411-32-30', 1, 5 ),
( null, 'Наталья', 'Александровна', '1985-04-28', 'kovtunec@yandex.ru', md5('789'), '8(861)693-38-09', 2, 5 ),
( 'Федорова', 'Ирина', 'Васильевна', '1977-07-01', 'i.fedorova77@mail.ru', md5('234'), '8(917)120-72-08', 2, 5 );
